{
    "champions": [
        
        {
            "name": "Rakan",
            "render": "assets/champions/renders/Rakan_Render.webp",
            "square": "assets/champions/squares/RakanSquare.webp",
            "lore": "As mercurial as he is charming, Rakan is an infamous vastayan troublemaker and the greatest battle-dancer in Lhotlan tribal history. To the humans of the Ionian highlands, his name had long been synonymous with wild festivals, uncontrollable parties, and anarchic music. But this energetic, traveling showman has left his old life behind, dedicating himself to the cause of his lover, the rebel Xayah. Together, they seek to free Ionia’s wild magic, restoring the vastaya’s birthright.",
            "spells": {
                "passive_1": {
                    "spellName": "Fey Feathers",
                    "passive": "Periodically, Rakan grants himself a shield that lasts until broken. After being out of combat for 5 seconds, any leftover shield will be restored to maximum value. Rakan's basic attacks and ability hits reduce Fey Feathers' Cooldown by 1 second for each enemy champion hit.",
                    "icon": "../spells/Rakan/Fey_Feathers.png"
                },
                
                "passive_2": {
                    "spellName": "Lover's Leap",
                    "passive": "If either Rakan or Xayah is channeling Recall, the other may move nearby and channel their own to sync their Recall time to their partner's Recall time.",
                    "icon": "../spells/Rakan/Lovers_Leap.png"
                },

                "q": {
                    "spellName": "Gleaming Quill",
                    "passive": "",
                    "active": "Rakan throws an enchanted feather in the target direction that deals magic damage to the first enemy hit. If the target was an enemy champion or epic monster, a radius is marked around Rakan. After 3 seconds or if an allied champion enters the radius, Rakan heals himself and nearby allied champions.",
                    "icon": "../spells/Rakan/Gleaming_Quill.png"
                },
                "w": {
                    "spellName": "Grand Entrance",
                    "passive": "",
                    "active": "Rakan dashes to the target location. After a brief delay upon arrival, he deals magic damage to nearby enemies and knocks them up for 1 second. Rakan will be knocked down by any immobilizing or polymorphing crowd control, excluding sleep, during Grand Entrance.",
                    "icon": "../spells/Rakan/Grand_Entrace.png"
                },
                "e": {
                    "spellName": "Battle Dance",
                    "passive": "",
                    "active": "Rakan grants a shield to the target allied champion for 3 seconds and then dashes to and around them. Battle Dance can be recast within 5 seconds at no additional cost. Rakan will be knocked down by any immobilizing or polymorphing crowd control, excluding sleep, during Battle Dance. If Xayah is the target, Battle Dance can be cast from an increased range.",
                    "icon": "../spells/Rakan/Battle_Dance.png"
                },
                "r": {
                    "spellName": "The Quickness",
                    "passive": "",
                    "active": "Rakan breaks into a captivating sprint, gaining ghosting and bonus movement speed for the duration. During this time, he deals magic damage to enemies he collides with and charms and slows them for a duration. This cannot affect the same enemy more than once. Colliding with an enemy champion extends The Quickness' duration, which can occur once per champion. When Rakan collides with his first enemy champion, he gains additional movement speed that decays over time. Rakan cannot basic attack enemy champions he did not collide with unless the attack command was input before the ability was cast.",
                    "icon": "../spells/Rakan/The_Quickness.png"
                }
            }
        },

        {
            "name": "Janna",
            "render": "assets/champions/renders/Janna_Render.webp",
            "square": "assets/champions/squares/JannaSquare.webp",
            "lore": "An ancient and mysterious wind spirit, Janna has come to protect the dispossessed of Zaun. While her presence is most often felt as a soothing breeze or a ferocious tempest, she also can manifest in corporeal form as an ethereal figure, comforting the downtrodden. Over the eons, Janna has witnessed the rise and fall of civilizations. Through it all, she remains steadfast as a beacon of hope to those in need.",
            "spells": {
                "passive": {
                    "spellName": "Tailwind",
                    "passive": "Janna grants bonus movement speed to nearby allied champions that are facing in the direction of her location. Additionally, her basic attacks on-hit and Zephyr deal bonus magic damage equal to a percentage of her bonus movement speed.",
                    "icon": "../spells/Janna/Tailwind.png"
                },
                "q": {
                    "spellName": "Howling Gale",                    
                    "passive": "",
                    "active": "Janna summons a whirlwind at her current location that charges up over time, increasing it's range, speed, damage, and knockup duration every second. Howling Gale can be recast at any time within the duration, and does so automatically after the duration expires.",
                    "icon": "../spells/Janna/Howling_Gale.png"
                },
                "w": {
                    "spellName": "Zephyr",
                    
                    "passive": "Janna is ghosted and gains bonus movement speed.",
                    "active": "Janna sends an air elemental at the target enemy that deals magic damage and slows them, capped at 99%.",
                    "icon": "../spells/Janna/Zephyr.png"
                    
                },
                "e": {
                    "spellName": "Eye of the Storm",
                    
                    "passive": "Whenever Janna's abilities slow or knock up at least one enemy champion, a portion of Eye of the Storm's cooldown is refunded. This may occur once per spell cast.",
                    "active": "Janna grants the target allied champion, turret, or herself a shield. While the shield holds, the target gains bonus attack damage.",
                    "icon": "../spells/Janna/Eye_of_the_Storm.png"
                    
                },
                "r": {
                    "spellName": "Monsoon",
                    
                    "passive": "",
                    "active": "Janna unleashes a blast that knocks back all nearby enemies, with the distance and duration being determined by proximity to Janna. Enemies cannot be knocked through terrain by Monsoon. Janna also channels for up to 3 seconds, healing nearby allies.",
                    "icon": "../spells/Janna/Monsoon.png"
            
                }
            }
        },

        {
            "name": "Maokai",
            "render": "assets/champions/renders/Maokai_Render.webp",
            "square": "assets/champions/squares/MaokaiSquare.webp",
            "lore": "Maokai is a rageful, towering treant who fights the unnatural horrors of the Shadow Isles. He was twisted into a force of vengeance after a magical cataclysm destroyed his home, surviving undeath only through the Waters of Life infused within his heartwood. Once a peaceful nature spirit, Maokai now furiously battles to banish the scourge of unlife from the Shadow Isles and restore his home to its former beauty.",
            "spells": {
                "passive": {
                    "spellName": "Sap Magic",
                    "passive": "Periodically, Maokai empowers his next basic attack to have an uncancellable windup, reset his basic attack timer, and heal him for a percentage of his maximum hp. Each time Maokai casts an ability, hits an enemy champion or epic monster with Sapling Toss, or is struck by an enemy's ability, Sap Magic's cooldown is reduced, modified to a smaller reduction if hit by a large monster's basic attack or ability.",
                    "icon": "../spells/Maokai/Sap_Magic.png"
                },
                "q": {
                    "spellName": "Bramble Smash",                    
                    "passive": "",
                    "active": "Maokai sends a shockwave in the target direction that deals magic damage to enemies hit and slows them briefly. Bramble Smash deals bonus magic damage to monsters. Enemies near Maokai are also briefly stunned and knocked back. Knock back distance scales with proximity to Maokai.",
                    "icon": "../spells/Maokai/Bramble_Smash.png"
                },
                "w": {
                    "spellName": "Twisted Advance",
                    "passive": "",
                    "active": "Maokai dashes to the target enemy while being untargetable. Upon arrival, he deals magic damage and roots them for a duration.",
                    "icon": "../spells/Maokai/Twisted_Advance.png"
                    
                },
                "e": {
                    "spellName": "Sapling Toss",
                    "passive": "",
                    "active": "Maokai flings a Sapling to the target location, granting sight of the area. Once landed, a Sapling remains stationary for a time or until it reacts to the first nearby visible enemy, chasing them. The Sapling explodes upon colliding with an enemy or when it expires, dealing magic damage to nearby enemies, and slowing them. A sapling's duration when placed in brush scales with Maokai's bonus HP, deals double damage to non-minion targets over 3 bursts, reveals them, and applies a slow scaling off of bonus HP and total AP.",
                    "icon": "../spells/Maokai/Sapling_Toss.png"
                    
                },
                "r": {
                    "spellName": "Nature's Grasp",
                    "passive": "",
                    "active": "Maokai summons a colossal wall of five throny brambles that slowly advances in the target direction, accelerating over time, each stopping when they collide with an enemy champion. Hitting at least one enemy champion grants Maoaki bonus movement speed decaying over 2 seconds. Each bramble deals magic damage to enemies hit and roots them for a time scaling off of distance traveled.",
                    "icon": "../spells/Maokai/Natures_Grasp.png"        
                }
            }
        }
    ]
}