{
    "champions": [
        {
            "name": "Rakan",
            "nickname": "The Charmer",
            "render": "assets/champions/renders/Rakan_Render.webp",
            "square": "assets/champions/squares/RakanSquare.webp",
            "bg": "../../assets/champions/splash/Rakan_Splash.webp",
            "lore": "As mercurial as he is charming, Rakan is an infamous vastayan troublemaker and the greatest battle-dancer in Lhotlan tribal history. To the humans of the Ionian highlands, his name had long been synonymous with wild festivals, uncontrollable parties, and anarchic music. But this energetic, traveling showman has left his old life behind, dedicating himself to the cause of his lover, the rebel Xayah. Together, they seek to free Ionia’s wild magic, restoring the vastaya’s birthright.",
            "spells": [
                {
                    "id": "p1",
                    "spellName": "Fey Feathers",
                    "passive": "Periodically, Rakan grants himself a shield that lasts until broken. After being out of combat for 5 seconds, any leftover shield will be restored to maximum value. Rakan's basic attacks and ability hits reduce Fey Feathers' Cooldown by 1 second for each enemy champion hit.",
                    "icon": "assets/spells/Rakan/Fey_Feathers.png"
                },
                {
                    "id": "p2",
                    "spellName": "Lover's Leap",
                    "passive": "If either Rakan or Xayah is channeling Recall, the other may move nearby and channel their own to sync their Recall time to their partner's Recall time.",
                    "icon": "assets/spells/Rakan/Lovers_Leap.png"
                },
                {
                    "id": "q",
                    "spellName": "Gleaming Quill",
                    "passive": "",
                    "active": "Rakan throws an enchanted feather in the target direction that deals magic damage to the first enemy hit. If the target was an enemy champion or epic monster, a radius is marked around Rakan. After 3 seconds or if an allied champion enters the radius, Rakan heals himself and nearby allied champions.",
                    "icon": "assets/spells/Rakan/Gleaming_Quill.png"
                },
                {
                    "id": "w",
                    "spellName": "Grand Entrance",
                    "passive": "",
                    "active": "Rakan dashes to the target location. After a brief delay upon arrival, he deals magic damage to nearby enemies and knocks them up for 1 second. Rakan will be knocked down by any immobilizing or polymorphing crowd control, excluding sleep, during Grand Entrance.",
                    "icon": "assets/spells/Rakan/Grand_Entrance.png"
                },
                {
                    "id": "e",
                    "spellName": "Battle Dance",
                    "passive": "",
                    "active": "Rakan grants a shield to the target allied champion for 3 seconds and then dashes to and around them. Battle Dance can be recast within 5 seconds at no additional cost. Rakan will be knocked down by any immobilizing or polymorphing crowd control, excluding sleep, during Battle Dance. If Xayah is the target, Battle Dance can be cast from an increased range.",
                    "icon": "assets/spells/Rakan/Battle_Dance.png"
                },
                {
                    "id": "r",
                    "spellName": "The Quickness",
                    "passive": "",
                    "active": "Rakan breaks into a captivating sprint, gaining ghosting and bonus movement speed for the duration. During this time, he deals magic damage to enemies he collides with and charms and slows them for a duration. This cannot affect the same enemy more than once. Colliding with an enemy champion extends The Quickness' duration, which can occur once per champion. When Rakan collides with his first enemy champion, he gains additional movement speed that decays over time. Rakan cannot basic attack enemy champions he did not collide with unless the attack command was input before the ability was cast.",
                    "icon": "assets/spells/Rakan/The_Quickness.png"
                }
            ]
        },
        {
            "name": "Janna",
            "nickname": "The Storm's Fury",
            "render": "assets/champions/renders/Janna_Render.webp",
            "square": "assets/champions/squares/JannaSquare.webp",
            "bg": "../../assets/champions/splash/Janna_Splash.webp",
            "lore": "An ancient and mysterious wind spirit, Janna has come to protect the dispossessed of Zaun. While her presence is most often felt as a soothing breeze or a ferocious tempest, she also can manifest in corporeal form as an ethereal figure, comforting the downtrodden. Over the eons, Janna has witnessed the rise and fall of civilizations. Through it all, she remains steadfast as a beacon of hope to those in need.",
            "spells": [
                {
                    "id": "p1",
                    "spellName": "Tailwind",
                    "passive": "Janna grants bonus movement speed to nearby allied champions that are facing in the direction of her location. Additionally, her basic attacks on-hit and Zephyr deal bonus magic damage equal to a percentage of her bonus movement speed.",
                    "icon": "assets/spells/Janna/Tailwind.png"
                },
                {
                    "id": "q",
                    "spellName": "Howling Gale",
                    "passive": "",
                    "active": "Janna summons a whirlwind at her current location that charges up over time, increasing it's range, speed, damage, and knockup duration every second. Howling Gale can be recast at any time within the duration, and does so automatically after the duration expires.",
                    "icon": "assets/spells/Janna/Howling_Gale.png"
                },
                {
                    "id": "w",
                    "spellName": "Zephyr",
                    "passive": "Janna is ghosted and gains bonus movement speed.",
                    "active": "Janna sends an air elemental at the target enemy that deals magic damage and slows them, capped at 99%.",
                    "icon": "assets/spells/Janna/Zephyr.png"
                },
                {
                    "id": "e",
                    "spellName": "Eye of the Storm",
                    "passive": "Whenever Janna's abilities slow or knock up at least one enemy champion, a portion of Eye of the Storm's cooldown is refunded. This may occur once per spell cast.",
                    "active": "Janna grants the target allied champion, turret, or herself a shield. While the shield holds, the target gains bonus attack damage.",
                    "icon": "assets/spells/Janna/Eye_of_the_Storm.png"
                },
                {
                    "id": "r",
                    "spellName": "Monsoon",
                    "passive": "",
                    "active": "Janna unleashes a blast that knocks back all nearby enemies, with the distance and duration being determined by proximity to Janna. Enemies cannot be knocked through terrain by Monsoon. Janna also channels for up to 3 seconds, healing nearby allies.",
                    "icon": "assets/spells/Janna/Monsoon.png"
                }
            ]
        },
        {
            "name": "Nami",
            "nickname": "The Tidecaller",
            "render": "assets/champions/renders/Nami_Render.webp",
            "square": "assets/champions/squares/NamiSquare.webp",
            "bg": "../../assets/champions/splash/Nami_Splash.webp",
            "lore": "A headstrong young vastaya of the seas, Nami was the first of the Marai tribe to leave the waves and venture onto dry land, when their ancient accord with the Targonians was broken. With no other option, she took it upon herself to complete the sacred ritual that would ensure the safety of her people. Amidst the chaos of this new age, Nami faces an uncertain future with grit and determination, using her Tidecaller staff to summon the strength of the oceans themselves.",
            "spells": [
                {
                    "id": "p1",
                    "spellName": "Surging Tides",
                    "passive": "Nami's Abilities grant bonus movement speed to allied champions hit, decaying over time. The bonus is doubled from Tidal Wave.",
                    "icon": "assets/spells/Nami/Surging_Tides.webp"
                },
                {
                    "id": "p2",
                    "spellName": "",
                    "passive": "",
                    "icon": ""
                },
                {
                    "id": "q",
                    "spellName": "Aqua Prison",
                    "passive": "",
                    "active": "Nami launches a bubble at the target location that lands after a delay, dealing magic damage to enemies hit and suspending them, during which they are revealed.",
                    "icon": "assets/spells/Nami/Aqua_Prison.webp"
                },
                {
                    "id": "w",
                    "spellName": "Ebb and Flow",
                    "passive": "",
                    "active": "Nami unleashes a stream of water onto the target champion or herself, which then bounces to nearby unaffected champions up to twice, alternating between enemies and allies and Nami.",
                    "icon": "assets/spells/Nami/Ebb_and_Flow.webp"
                },
                {
                    "id": "e",
                    "spellName": "Tidecaller's Blessing",
                    "passive": "",
                    "active": "Nami blesses herself or an allied champion for 6 seconds, empowering their next 3 basic attacks or abilities to each deal bonus magic damage and slow enemies.",
                    "icon": "assets/spells/Nami/Tidecallers_Blessing.webp"
                },
                {
                    "id": "r",
                    "spellName": "Tidal Wave",
                    "passive": "",
                    "active": "Nami surges a tidal wave in the target direction, granting sight around its trajectory as it travels, dealing magic damage to enemies hit, knocking them up and slowing them for a duration scaling with distance traveled.",
                    "icon": "assets/spells/Nami/Tidal_Wave.webp"
                }
            ]
        },
        {
            "name": "Sona",
            "nickname": "Maven of the Strings",
            "render": "assets/champions/renders/Sona_Render.webp",
            "square": "assets/champions/squares/SonaSquare.webp",
            "bg": "../../assets/champions/splash/Sona_Splash.webp",
            "lore": "Sona is a virtuoso of the stringed etwahl, speaking only through her graceful chords and vibrant arias. Her genteel manner has endeared her to the Demacian nobility, though some speculate her arresting melodies actually emanate magic — a dangerous prospect in the kingdom. Silent to outsiders but understood easily enough by close companions, Sona plucks her harmonies not only to soothe injured allies, but also to strike down unsuspecting enemies.",
            "spells": [
                {
                    "id": "p1",
                    "spellName": "Power Chord - Accelerando",
                    "passive": "Sona generates a stack of Accelerando each time she hits an enemy champion with Hymn of Valor and each time she mitigates sufficient damage or heals damaged allies with Aria of Perseverance, stacking up to 120 times. At maximum stacks, she instead reduces the current cooldown of Crescendo each time. For each stack of Accelerando, Sona gains basic ability haste to a cap.",
                    "icon": "assets/spells/Sona/Power_Chord.webp"
                },
                {
                    "id": "p2",
                    "spellName": "Melody",
                    "passive": "Whenever Sona casts a basic ability, her other basic abilities incur a global cooldown and she generates a unique aura that empowers herself and nearby allied champions.",
                    "icon": "assets/spells/Sona/Power_Chord_3.webp"
                },
                {
                    "id": "p3",
                    "spellName": "Power Chord",
                    "passive": "Sona's basic abilities generate a stack of Power Chord, stacking up to 3 times. At 3 stacks, her next basic attack is empowered to consume them all to have an uncancellable windup, deal bonus magic damage, and apply an additional effect based on the last basic ability she cast. Hymn of Valor: Staccato deals modified magic damage, Aria of Perseverance:Diminuendo reduces the target's size and damage dealt, and Song of Celerity:Tempo slows the target capped at a max of 99%.",
                    "icon": "assets/spells/Sona/Power_Chord_2.webp"
                },
                {
                    "id": "q",
                    "spellName": "Hymn of Valor",
                    "passive": "Melody - Sona and tagged allied champions deal bonus magic damage on their next basic attack within 5 seconds.",
                    "active": "Sona sends out bolts of sound to the two nearest visible enemies, prioritizing champions. Each bolt deals magic damage and grants sight of the area around the target for 1 second. Sona gains a stack of Accelerando for each bolt that hits an enemy champion.",
                    "icon": "assets/spells/Sona/Hymn_of_Valor.webp"
                },
                {
                    "id": "w",
                    "spellName": "Aria of Perseverence",
                    "passive": "Sona and tagged allied champions are granted a shield. Sona gains a stack of Accelerando whenever she heals a wounded ally or shields a minimum amount of damage for an ally with Aria of Perseverance.",
                    "active": "Sona heals herself and sends out a tone to heal with the most wounded allied champion nearby.",
                    "icon": "assets/spells/Sona/Aria_of_Perseverance.webp"
                },
                {
                    "id": "e",
                    "spellName": "Song of Celerity",
                    "passive": "Tagged allied champions gain bonus movement speed for 3 seconds.",
                    "active": "Sona gains movement speed. If she takes damage during this time, the duration ends prematurely once or if a few seconds have elapsed.",
                    "icon": "assets/spells/Sona/Song_of_Celerity.webp"
                },
                {
                    "id": "r",
                    "spellName": "Crescendo",
                    "passive": "",
                    "active": "Sona strikes an irresistible chord in the target direction that deals magic damage to enemies hit and stuns them.",
                    "icon": "assets/spells/Sona/Crescendo.webp"
                }
            ]
        },
        {
            "name": "Braum",
            "nickname": "The Heart of the Freljord",
            "render": "assets/champions/renders/Braum_Render.webp",
            "square": "assets/champions/squares/BraumSquare.webp",
            "bg": "../../assets/champions/splash/Braum_Splash.webp",
            "lore": "Blessed with massive biceps and an even bigger heart, Braum is a beloved Iceborn hero of the Freljord. Every mead hall north of Frostheld toasts his legendary strength and tells tales of how he felled a forest of oaks in a single night, and punched an entire mountain into rubble. With his shield, an enchanted vault door forged in ages past, Braum roams the frozen north as a cheerful protector, helping the vulnerable as he works toward his dream of a peaceful Freljord.",

            "spells": [
                {
                    "id": "p1",
                    "spellName": "Concussive Blows",
                    "passive": "Braum's basic attacks and Winter's Bite each apply a stack of Concussive Blows to their target, refreshing on subsequent applications and stacking up to 4 times. Once the first stack has been applied, any allied champion's basic attack applies an additional stack to the target on-hit. The fourth stack against a target consumes them all to deal magic damage and stun them. This effect cannot apply to the same target more than once every few seconds. During this immunity period, affected targets take bonus magic damage from Braum's basic attacks.",
                    "icon": "assets/spells/Braum/Concussive_Blows.webp"
                },
                {
                    "id": "q",
                    "spellName": "Winter's Bite",
                    "active": "Braum propels ice from his shield in the target direction, dealing magic damage to the first enemy hit and slowing them.",
                    "icon": "assets/spells/Braum/Winters_Bite.webp"
                },
                {
                    "id": "w",
                    "spellName": "Stand Behind Me",
                    "active": "Braum dashes to put himself between the target ally and the closest visible enemy champion, and upon arrival grants himself and the ally bonus armor and bonus magic resistance for a few seconds.",
                    "icon": "assets/spells/Braum/Stand_Behind_Me.webp"
                },
                {
                    "id": "e",
                    "spellName": "Unbreakable",
                    "active": "Braum sets his shield in the target direction for a few seconds, creating a barrier that intercepts all incoming hostile projectiles and reduces the damage Braum takes through it. The first instance of damage dealt by a champion from this direction is reduced by 100%. While his shield is raised, Braum also gains bonus movement speed and ghosting.",
                    "icon": "assets/spells/Braum/Unbreakable.webp"
                },
                {
                    "id": "r",
                    "spellName": "Glacial Fissure",
                    "active": "Braum leaps into the air and slams his shield into the ground, creating a fissure that travels forth in the target direction, dealing magic damage to enemies within its path and those around Braum. The first target hit is knocked up, increased if they are further away from Braum. All other enemies hit are knocked up. A field of ice is created along the fissure's path, slowing enemies within the area. The field disappears after the duration ends in the same order and speed it was created with.",
                    "icon": "assets/spells/Braum/Glacial_Fissure.webp"
                }
            ]
        },
        {
            "name": "Leona",
            "nickname": "The Radiant Dawn",
            "render": "assets/champions/renders/Leona_Render.webp",
            "square": "assets/champions/squares/LeonaSquare.webp",
            "bg": "../../assets/champions/splash/Leona_Splash.webp",
            "lore": "Imbued with the fire of the sun, Leona is a holy warrior of the Solari who defends Mount Targon with her Zenith Blade and the Shield of Daybreak. Her skin shimmers with starfire while her eyes burn with the power of the celestial Aspect within her. Armored in gold and bearing a terrible burden of ancient knowledge, Leona brings enlightenment to some, death to others.",

            "spells": [
                {
                    "id": "p1",
                    "spellName": "Sunlight",
                    "passive": "Leona's abilities mark enemies hit, refreshing on subsequent hits. Allied champions' damaging attacks and abilities against a marked target will consume the mark to deal bonus magic damage.",
                    "icon": "assets/spells/Leona/Sunlight.webp"
                },
                {
                    "id": "q",
                    "spellName": "Shield of Daybreak",
                    "active": "Leona illuminates her shield, empowering her next basic attack to gain bonus range, deal bonus magic damage and stun the target. Shield of Daybreak resets Leona's basic attack timer.",
                    "icon": "assets/spells/Leona/Shield_of_Daybreak.webp"
                },
                {
                    "id": "w",
                    "spellName": "Eclipse",
                    "active": "Leona raises her guard, gaining flat damage reduction and bonus armor and bonus magic resistance. Her shield detonates after the duration, dealing magic damage to nearby enemies. If this hits an enemy, Leona's guard is extended for an additional duration.",
                    "icon": "assets/spells/Leona/Eclipse.webp"
                },
                {
                    "id": "e",
                    "spellName": "Zenith Blade",
                    "active": "Leona projects her sword in the target direction that deals magic damage to enemies hit. If she hits at least one enemy champion, she will dash behind the last one struck and root them. Leona is unable to move or attack while Zenith Blade is in flight. She can cast any of her abilities during the dash.",
                    "icon": "assets/spells/Leona/Zenith_Blade.webp"
                },
                {
                    "id": "r",
                    "spellName": "Solar Flare",
                    "active": "Leona calls down a solar flare that strikes upon the target location, granting sight of the area before impact and for another duration afterwards. Enemies hit are dealt magic damage. Targets are also slowed or stunned for the same duration if they are hit by the epicenter.",
                    "icon": "assets/spells/Leona/Solar_Flare.webp"
                }
            ]
        }
    ]
}